-- 
--  1 La tabla `tbl1` tiene la siguiente estructura:
-- 
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--  Escriba una consulta en SQL que devuelva la suma del campo c12.
-- 
--  Rta/
--     SUM(c12)
--  0  15137.63
--
--  >>> Escriba su codigo a partir de este punto <<<

In [22]:
import sqlite3
import pandas as pd
import sys

In [23]:
conn = sqlite3.connect(":memory:")
cur = conn.cursor()

In [24]:
with open("create_tables.sql", encoding="utf-8") as file:
    cur.executescript(file.read())

In [25]:
cur.execute("SELECT * FROM tbl1;").fetchall()

[('E', 1, 273.08, 600, '2016-12-31', 0.21, 'BDGD'),
 ('D', 2, 756.37, 500, '2019-02-28', 0.37, 'BCCC'),
 ('E', 3, 305.43, 100, '2017-05-21', 0.21, 'BAED'),
 ('D', 4, 662.69, 800, '2017-03-26', 0.23, 'BGDD'),
 ('C', 5, 822.81, 100, '2017-11-17', 0.35, 'GGFC'),
 ('A', 6, 391.42, 300, '2018-05-15', 0.22, 'BFGB'),
 ('C', 7, 755.27, 800, '2018-07-04', 0.47, 'GCDB'),
 ('E', 8, 302.86, 700, '2016-12-22', 0.14, 'DFCC'),
 ('C', 9, 267.42, 200, '2018-04-18', 0.1, 'DGCE'),
 ('A', 10, 816.51, 600, '2019-04-25', 0.4, 'DAGC'),
 ('C', 11, 346.64, 900, '2017-04-18', 0.15, 'FBBC'),
 ('B', 12, 999.72, 800, '2016-11-09', 0.26, 'FCGD'),
 ('C', 13, 712.61, 400, '2017-10-23', 0.31, 'EDDA'),
 ('E', 14, 832.44, 800, '2016-11-22', 0.39, 'EGFD'),
 ('C', 15, 370.58, 900, '2016-10-01', 0.11, 'GCDD'),
 ('B', 16, 283.4, 600, '2019-04-11', 0.14, 'BDEE'),
 ('E', 17, 692.93, 200, '2018-03-25', 0.25, 'BGGA'),
 ('A', 18, 142.99, 100, '2017-02-12', 0.48, 'GGFD'),
 ('C', 19, 570.43, 400, '2019-04-12', 0.48, 'FBEE'),
 ('A', 20, 938.16, 300, '2016-09-12', 0.19, 'BECB'),
 ('B', 21, 409.34, 400, '2019-04-29', 0.23, 'GFAE'),
 ('E', 22, 118.77, 900, '2016-10-29', 0.32, 'GEFE'),
 ('E', 23, 325.15, 200, '2019-04-21', 0.19, 'FBGC'),
 ('C', 24, 482.32, 300, '2019-05-03', 0.11, 'CCCE'),
 ('E', 25, 600.9, 700, '2018-11-07', 0.36, 'BBBA'),
 ('A', 26, 456.47, 400, '2018-01-28', 0.11, 'FGED'),
 ('E', 27, 720.9, 800, '2017-01-16', 0.12, 'FBGD'),
 ('B', 28, 326.45, 700, '2017-07-27', 0.36, 'AGAA'),
 ('D', 29, 317.77, 200, '2017-02-27', 0.47, 'GCEA'),
 ('A', 30, 135.8, 900, '2017-01-26', 0.23, 'EGAB')]

In [26]:
cur.execute("SELECT SUM(c12) FROM tbl1;").fetchall()

[(15137.63,)]

-- 
--  2 La tabla `data` tiene la siguiente estructura:
-- 
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
-- 
--  Escriba una consulta que retorne la cantidad de registros
--  de la tabla `tbl1`.
-- 
--  Rta/
--     COUNT(*)
--  0        30
--
--  >>> Escriba su codigo a partir de este punto <<<

In [27]:
cur.execute("SELECT COUNT(*) FROM tbl1;").fetchall()

[(30,)]

-- 3 La tabla `tbl1` tiene la siguiente estructura:
-- 
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
-- 
--  Escriba una consulta que retorne los primeros cinco
--  registros de la tabla `tbl1` ordenados por fecha.
-- 
--  Rta/
--    K0  K1     c12  c13         c14   c15   c16
--  0  A  20  938.16  300  2016-09-12  0.19  BECB
--  1  C  15  370.58  900  2016-10-01  0.11  GCDD
--  2  E  22  118.77  900  2016-10-29  0.32  GEFE
--  3  B  12  999.72  800  2016-11-09  0.26  FCGD
--  4  E  14  832.44  800  2016-11-22  0.39  EGFD
--
--  >>> Escriba su codigo a partir de este punto <<<

In [28]:
cur.execute("SELECT * FROM tbl1 ORDER BY c14 LIMIT 5").fetchall()

[('A', 20, 938.16, 300, '2016-09-12', 0.19, 'BECB'),
 ('C', 15, 370.58, 900, '2016-10-01', 0.11, 'GCDD'),
 ('E', 22, 118.77, 900, '2016-10-29', 0.32, 'GEFE'),
 ('B', 12, 999.72, 800, '2016-11-09', 0.26, 'FCGD'),
 ('E', 14, 832.44, 800, '2016-11-22', 0.39, 'EGFD')]

-- 4 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne los campos K0 y c16
--  para los registros de la tabla tbl1 para los que la 
--  columna c16 empieza por la misma letra de la columna K0.
--
--  Rta/
--    K0   c16
--  0  E  EGFD
--  1  B  BDEE
--  2  C  CCCE
--
--  >>> Escriba su codigo a partir de este punto <<<

In [29]:
cur.execute("SELECT K0,c16 FROM tbl1 WHERE SUBSTR(c16,1,1) =SUBSTR(K0,1,1)").fetchall()

[('E', 'EGFD'), ('B', 'BDEE'), ('C', 'CCCE')]

-- 5 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne todos los campos de 
--  la tabla tbl0 para los que el campo c02 es igual a 100
--  o igual a 600
-- 
-- Rta/
--    K0   c01  c02    c03  c04
--  0  B  7000  100  OLPKN  0.2
--  1  C  1000  600  LMMML  0.2
--  2  D  4000  600  PJLJL  0.4
--  3  G  5000  100  NLPLO  0.2
--
--  >>> Escriba su codigo a partir de este punto <<<

In [30]:
cur.execute("SELECT * FROM tbl0 WHERE c02 in (100,600)").fetchall()

[('B', 7000, 100, 'OLPKN', 0.2),
 ('C', 1000, 600, 'LMMML', 0.2),
 ('D', 4000, 600, 'PJLJL', 0.4),
 ('G', 5000, 100, 'NLPLO', 0.2)]

--  6 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne todos los campos de 
--  la tabla tbl1 ordenada por fecha (c14) para los 
--  registros con K0 igual a A
-- 
--  Rta/
--    K0  K1     c12  c13         c14   c15   c16
--  0  A  20  938.16  300  2016-09-12  0.19  BECB
--  1  A  30  135.80  900  2017-01-26  0.23  EGAB
--  2  A  18  142.99  100  2017-02-12  0.48  GGFD
--  3  A  26  456.47  400  2018-01-28  0.11  FGED
--  4  A   6  391.42  300  2018-05-15  0.22  BFGB
--  5  A  10  816.51  600  2019-04-25  0.40  DAGC
--
--  >>> Escriba su codigo a partir de este punto <<<

In [31]:
cur.execute("SELECT * FROM tbl1 WHERE K0='A' ORDER BY c14").fetchall()

[('A', 20, 938.16, 300, '2016-09-12', 0.19, 'BECB'),
 ('A', 30, 135.8, 900, '2017-01-26', 0.23, 'EGAB'),
 ('A', 18, 142.99, 100, '2017-02-12', 0.48, 'GGFD'),
 ('A', 26, 456.47, 400, '2018-01-28', 0.11, 'FGED'),
 ('A', 6, 391.42, 300, '2018-05-15', 0.22, 'BFGB'),
 ('A', 10, 816.51, 600, '2019-04-25', 0.4, 'DAGC')]

--  7 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne todos los campos de 
--  la tabla tbl1 ordenada por fecha (c14) para los 
--  registros con K0 diferente a A y B y c13 diferente 
--  de 200 y 900
--
--  Rta/
--     K0  K1     c12  c13         c14   c15   c16
--  0   E  14  832.44  800  2016-11-22  0.39  EGFD
--  1   E   8  302.86  700  2016-12-22  0.14  DFCC
--  ...
--  11  C  19  570.43  400  2019-04-12  0.48  FBEE
--  12  C  24  482.32  300  2019-05-03  0.11  CCCE
-- 
--  >>> Escriba su codigo a partir de este punto <<<

In [32]:
cur.execute("SELECT * FROM tbl1 WHERE K0 NOT IN ('A','B') AND c13 NOT IN (200,900) ORDER BY c14").fetchall()

[('E', 14, 832.44, 800, '2016-11-22', 0.39, 'EGFD'),
 ('E', 8, 302.86, 700, '2016-12-22', 0.14, 'DFCC'),
 ('E', 1, 273.08, 600, '2016-12-31', 0.21, 'BDGD'),
 ('E', 27, 720.9, 800, '2017-01-16', 0.12, 'FBGD'),
 ('D', 4, 662.69, 800, '2017-03-26', 0.23, 'BGDD'),
 ('E', 3, 305.43, 100, '2017-05-21', 0.21, 'BAED'),
 ('C', 13, 712.61, 400, '2017-10-23', 0.31, 'EDDA'),
 ('C', 5, 822.81, 100, '2017-11-17', 0.35, 'GGFC'),
 ('C', 7, 755.27, 800, '2018-07-04', 0.47, 'GCDB'),
 ('E', 25, 600.9, 700, '2018-11-07', 0.36, 'BBBA'),
 ('D', 2, 756.37, 500, '2019-02-28', 0.37, 'BCCC'),
 ('C', 19, 570.43, 400, '2019-04-12', 0.48, 'FBEE'),
 ('C', 24, 482.32, 300, '2019-05-03', 0.11, 'CCCE')]

-- 8 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que compute el promedio
--  de la columna c21 de la tabla tbl2 por ano 
--  (columna c23).
--
--  Rta/
--     YEAR    avg(c21)
--  0  2016  564.476429
--  1  2017  515.156364
--  2  2018  557.559375
--  3  2019  550.998571
--
--  >>> Escriba su codigo a partir de este punto <<<

In [42]:
cur.execute("SELECT SUBSTR(c23,1,4) AS YEAR,AVG(c21) FROM tbl2 GROUP BY SUBSTR (c23,1,4)").fetchall()

[('2016', 564.4764285714285),
 ('2017', 515.1563636363637),
 ('2018', 557.5593749999999),
 ('2019', 550.9985714285714)]

In [45]:
cur.execute("SELECT AVG(c21) FROM tbl2 GROUP BY strftime('%Y',c23)").fetchall()

[(564.4764285714285,),
 (515.1563636363637,),
 (557.5593749999999,),
 (550.9985714285714,)]

-- 9 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne el registro
--  con el menor valor en la columna c21 de la 
--  tabla tbl2.
--
--  Rta/
--     K1     c21  c22         c23   c24    c25
--  0  29  101.11  100  2017-11-17  0.42  MV-CB
--
--  >>> Escriba su codigo a partir de este punto <<<

In [34]:
cur.execute("SELECT * FROM tbl2 WHERE c21 = (SELECT min(c21) FROM tbl2)").fetchall()

[(29, 101.11, 100, '2017-11-17', 0.42, 'MV-CB')]

-- 10 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne todos los 
--  campos de los registros de la tabla tbl0 
--  con la columna c02 mayor o igual a 300.
--
--  Rta/
--     K0   c01  c02    c03  c04
--  0   A  5000  900  NMNJL  0.4
--  1   C  1000  600  LMMML  0.2
--  2   D  4000  600  PJLJL  0.4
--  3   F  2000  300  NNPJO  0.3
--  4   I  3000  300  PPPPL  0.3
--
--  >>> Escriba su codigo a partir de este punto <<<

In [35]:
cur.execute("SELECT * FROM tbl0 WHERE c02 >= 300").fetchall()

[('A', 5000, 900, 'NMNJL', 0.4),
 ('C', 1000, 600, 'LMMML', 0.2),
 ('D', 4000, 600, 'PJLJL', 0.4),
 ('F', 2000, 300, 'NNPJO', 0.3),
 ('I', 3000, 300, 'PPPPL', 0.3)]

-- 11 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne el total 
--  de registros de la tabla tbl1 para el ano
--  2018
--
--  Rta/
--     YEAR  CANT
--  0  2018     6
--
--  >>> Escriba su codigo a partir de este punto <<<

In [36]:
cur.execute("SELECT SUBSTR(c14,1,4) AS YEAR,COUNT(*) AS CANT FROM tbl1 WHERE SUBSTR(c14,1,4) = '2018' GROUP BY SUBSTR(c14,1,4)").fetchall()

[('2018', 6)]

In [37]:
cur.execute("SELECT COUNT(*) FROM tbl1 WHERE strftime('%Y', c14) = '2018'").fetchall()

[(6,)]

-- 12 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne por cada letra
--  de la columna K0, el valor máximo de la coumna c12
--  en la tabla tbl1.
--
--  Rta/
--    K0  MAX(c12)  min(C12)
--  0  A    938.16    135.80
--  1  B    999.72    283.40
--  2  C    822.81    267.42
--  3  D    756.37    317.77
--  4  E    832.44    118.77
--
--  >>> Escriba su codigo a partir de este punto <<<

In [38]:
cur.execute("SELECT K0, max(c12) AS 'MAX(c12)', min(c12) AS 'min(C12)' FROM tbl1 GROUP BY K0").fetchall()

[('A', 938.16, 135.8),
 ('B', 999.72, 283.4),
 ('C', 822.81, 267.42),
 ('D', 756.37, 317.77),
 ('E', 832.44, 118.77)]

In [39]:
cur.execute("SELECT K0, MAX(c12), MIN(c12) FROM tbl1 GROUP BY K0").fetchall()

[('A', 938.16, 135.8),
 ('B', 999.72, 283.4),
 ('C', 822.81, 267.42),
 ('D', 756.37, 317.77),
 ('E', 832.44, 118.77)]

-- 13 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne por cada letra
--  de la columna K0, el valor promedio de la columna c12
--  en la tabla tbl1, para aquellos registros con c13 mayor
--  a 400.
--
--  Rta/
--    K0    avg(c12)
--  0  A  476.155000
--  1  B  536.523333
--  2  C  490.830000
--  3  D  709.530000
--  4  E  474.825000
-- 
--  >>> Escriba su codigo a partir de este punto <<<

In [40]:
cur.execute("SELECT K0, avg(c12) FROM tbl1 WHERE c13 > 400 GROUP BY K0").fetchall()

[('A', 476.155),
 ('B', 536.5233333333333),
 ('C', 490.8299999999999),
 ('D', 709.53),
 ('E', 474.82500000000005)]

--  14 Sea el siguiente conjunto de tablas en una base de datos:
-- 
--    tbl0
--    ------------------------
--    K0  CHAR(1)
--    c01 INT
--    c02 INT
--    c03 CHAR(4)
--    c04 FLOAT
--        
--    tbl1
--    ------------------------
--    K0  CHAR(1)
--    K1  INT
--    c12 FLOAT
--    c13 INT
--    c14 DATE
--    c15 FLOAT
--    c16 CHAR(4)
--
--    tbl2
--    ------------------------
--    K1  INT,
--    c21 FLOAT,
--    c22 INT,
--    c23 DATE,
--    c24 FLOAT,
--    c25 CHAR(5)
--
--  Escriba una consulta que retorne por cada letra de la
--  columna K0 de la tabla tbl1, el valor promedio de la 
--  columna c21 en la tabla tbl2, para aquellos registros
--  con c13 mayor a 400.
--
--  Rta/
--  K0    avg(c21)
--  0  A  593.495000
--  1  B  575.470000
--  2  C  530.753000
--  3  D  655.612500
--  4  E  555.323077
--
--  >>> Escriba su codigo a partir de este punto <<<

In [41]:
cur.execute("SELECT t1.K0, avg(t2.c21) as 'avg(c21)' FROM tbl1 t1 inner join tbl2 t2 on t1.K1 = t2.K1 WHERE t1.c13 > 400 GROUP BY t1.K0").fetchall()

[('A', 593.495),
 ('B', 575.47),
 ('C', 530.7529999999999),
 ('D', 655.6125),
 ('E', 555.323076923077)]